{"metadata":{"title":"AQUATk: An Audio QUality Assessment Toolkit","date":"Nov 20, 2023","excerpt":"You got the audio? I have the metrics!"},"content":"<p>In 2022, my advisor and I published a paper called \"Evaluating generative audio systems and their metrics\" at ISMIR 2022, where we discussed this set of problems with evaluation of neural audio synthesis techniques at large:</p>\n<ol>\n<li>What are the metrics?</li>\n<li>Do any of them line up with perception?</li>\n<li>How do we evaluate these systems?</li>\n</ol>\n<p>While running the experiments necessary to extract sounds and their corresponding metrics, I noticed that the tooling around extracting metrics was not good. As an example, if I were to compute the Frechet Audio Distance, I'd have to do the following:</p>\n<ul>\n<li>Decide if I'm using Tensorflow (the reference implementation) or Pytorch (everyone's favorite framework)</li>\n<li>Setup google's entire research repo</li>\n<li>Spend time setting up the environment for <em>one</em> directory</li>\n<li>Break everything because of tensorflow and numpy</li>\n<li>Fix everything somehow</li>\n<li>Find that I now have to setup the VGGish model too?</li>\n<li>Spend time setting up the environment for <em>another</em> directory</li>\n<li>Once VGGish is setup, I can finally extract the embeddings</li>\n</ul>\n<p>Broadly, this is a significantly terrible way to extract metrics in my opinion. This is so far behind the curve compared to the tooling available to evaluate things like images and text. For instance, you can just download torchmetrics and use it directly to evaluate your models (which is great!) and while torchmetrics does come with a built in set of metrics for audio, it's not as exhaustive per se.</p>\n<p>So, I decided to build a toolkit that would allow me to extract metrics from audio files in a way that is easy to use and easy to extend. It's available on <a href=\"https://github.com/ashvala/AQUA-Tk\">Github</a>. It will be on PyPi soon (check back in a few days).</p>\n<p>In the meanwhile, it has support the following metrics:</p>\n<table>\n<thead>\n<tr>\n<th></th>\n<th></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>FAD</td>\n<td>Frechet Audio Distance</td>\n</tr>\n<tr>\n<td>KID</td>\n<td>Kernel Inception Distance</td>\n</tr>\n<tr>\n<td>PEAQb</td>\n<td>Basic PEAQ</td>\n</tr>\n<tr>\n<td>NDB/k</td>\n<td>Number of Different Bins over K</td>\n</tr>\n<tr>\n<td>SISDR</td>\n<td>Scale-Invariant SDR</td>\n</tr>\n<tr>\n<td>SNR</td>\n<td>Signal-to-Noise Ratio</td>\n</tr>\n<tr>\n<td>MAE</td>\n<td>Mean Absolute Error</td>\n</tr>\n<tr>\n<td>MSE</td>\n<td>Mean Squared Error</td>\n</tr>\n<tr>\n<td>KL</td>\n<td>Kullback-Leibler Divergence</td>\n</tr>\n</tbody>\n</table>\n<p>It also has a cool Python port of PEAQ!</p>\n<p>I'm still working on adding documentation, more metrics and improving the code quality. If you have any suggestions, please feel free to open an issue on Github!</p>\n<p>Looking forward to you using the toolkit!</p>"}