{"metadata":{"layout":"portfolio_page","title":"LiveAds","Tech":["NodeJS","PhantomJS","GraphQL","Swift","ffmpeg","WebSockets"],"date":"Mar 27, 2023"},"content":"<p>Website: <a href=\"http://liveads.com\">http://liveads.com</a></p>\n<p>Streamstager: <a href=\"http://streamstager.com\">http://streamstager.com</a></p>\n<hr>\n<p>LiveAds is a startup based out of San Francisco, CA focused on turning brands into broadcasters. During my time at LiveAds, I worked on two projects - Prompt and StreamStager.</p>\n<p>Prompt was a research project intent on exploring the idea of a modern day teleprompter, that would shape the prompts according to events in a live stream. I built the backend architecture that handled video encoding. Video captured from the iPhone was streamed to an EC2 GPU instance via RTSP, which encoded the data with an HTML5 overlay.</p>\n<p>The encoder used a nodejs server to orchestrate the lifecycle of a stream. At the start of a stream - the app sends a signal, spawning a <code>ffmpeg</code> instance that reads the RTSP data. <code>ffmpeg</code> merges it with the raw image data output by Phantomjs (a headless browser typically used for unit testing) every 1/30th of a second. The HTML5 overlay was controlled by the user via WebSockets, so that the view a person sees on the phone and the view on facebook would remain consistent. When the phone sends a disconnect signal, the server would terminate the ffmpeg instance.</p>\n<p>Streamstager is at the heart of LiveAds’ current product line - it is a desktop app that allows brands to overlay dynamic content to their streams. This was used during Visa’s run up to the Super Bowl week in 2017, which featured athletes such as Steve Smith Sr., Greg Olsen and Antonio Brown. The livestreams can be found on the Visa USA page. The bulk of this was written in JavaScript. The API was scripted with a combination of JavaScript and GraphQL.</p>\n<p>I designed the architecture and back-end database schema that streamlined the data entry and parsing process significantly. Additionally, I built plugins that allowed for interactive comment presentation during the streams - used during the Q&#x26;A sections of the streams.</p>"}